let result;

function* millioner() {
    alert("Բարի գալուստ խաղ, ով է ուզում դառնալ միլիոնատեր");
    let sum = 0;
    do {
        result = prompt(`հարց 1
    Ո՞ր օրն է համարվում շաբաթվա առաջին օրը Իսրայելում ? 
    a)Կիրակի    b) Շաբաթ    c) Ուրբաթ   d) Երկուշաբթի`);
    } while (!result);

    if (result === "a") {
        sum += 15000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք");
    }
    yield;
    do {
        result = prompt(`հարց 2
    Ի՞նչպես է կոչվում մարդկային մարմնի մոդելը՝ բժիշկների ուսուցման իրազննականության համար?
    a) Ուրվական   b) Խրտվիլակ   c) Ֆանտոմ   d) Ոգի`);
    } while (!result);

    if (result === "c") {
        sum += 35000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք");
    }
    yield;
    do {
        result = prompt(`հարց 3
    Ո՞ր քիմիական տարրի հայտնագործման պատվին են Ֆրանսիայում 19-րդ դարում հատել Ապոլոնի պատկերով մեդալ ?
     a) Հելիում   b)  Ջրածին   c)  Տիտան   d)  Ռադիում`);
    } while (!result);

    if (result === "a") {
        sum += 100000;
        let comf = confirm(
            `դուք հասել եք անձեռնմխելի գումարին ` +
            sum +
            `AMD!
    եթե ցանկանում եք շարունակել խաղալ ապա սեղմեք OK, եթե ցանկանում եք վերցնել գումարը եվ դուրս գալ սեղմեք Cancel`
        );

        if (comf === true) {
            alert("Լավ շարունակում ենք ");
        } else {
            return alert("Դուք վաստակել եք " + sum + "AMD, խաղն ավարտված է ");
        }
    } else {
        return alert("ցավոք դուք պարտվեցիրք");
    }
    yield;
    do {
        result = prompt(`հարց 4
    Ավանդաբար ի՞նչ են անում երաժիշտները Հայդնի «Հրաժեշտի սիմֆոնիան» նվագելիս ?
    a) Գլխարկ են հագնում   b) Երգում են  c) Հանգցնում են մոմերը d) Օդային համբույրներ են ուղարկում`);
    } while (!result);

    if (result === "c") {
        sum += 100000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք Դուք վաստակել եք 150000AMD");
    }
    yield;
    do {
        result = prompt(`հարց 5
    Ըստ իր խոստովանության ինչի՞ աստվածն էր Օլե Լուկոյեն՝ Անդերսենի համանուն հեքիաթից․ ?
    a) Մանկության    b) Հեքիաթների   c) Գիշերվա  d) Երազների`);
    } while (!result);

    if (result === "d") {
        sum += 100000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք Դուք վաստակել եք 150000AMD");
    }
    yield;
    do {
        result = prompt(`հարց 6
    Ո՞վ էր Հենրի Թեյթը, ում անունով է կոչվում Լոնդոնի պատկերասրահը․ ?
    a) Ծովահեն   b) Բարերար   c) Նկարիչ  d) Ճարտարապետ`);
    } while (!result);

    if (result === "b") {
        sum += 100000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք Դուք վաստակել եք 150000AMD");
    }
    yield;
    do {
        result = prompt(`հարց 7
    Ո՞ւմ են պարգևատրում Ֆյոդոր Պլևակոի անվան մեդալով ?
    a) Փաստաբաններին  b) Լրագրողներին  c) Լուսանկարիչներին  d) Բժիշկներին`);
    } while (!result);

    if (result === "a") {
        sum += 100000;
        let comf = confirm(
            `դուք հասել եք անձեռնմխելի գումարին ` +
            sum +
            `AMD!
    եթե ցանկանում եք շարունակել խաղալ ապա սեղմեք OK, եթե ցանկանում եք վերցնել գումարը եվ դուրս գալ սեղմեք Cancel`
        );
        if (comf === true) {
            alert("Լավ շարունակում ենք");
        } else {
            return alert("Դուք վաստակել եք " + sum + "AMD, խաղն ավարտված է ");
        }
    } else {
        return alert("ցավոք դուք պարտվեցիրք");
    }
    yield;
    do {
        result = prompt(`հարց 8
    Ո՞ր կենդանին չի կարող ձայն հանել, քանի որ չունի վոկալային լարեր ?
     a) Կրիա     b) Ընձուղտ   c) Ձի  d) Վարազ`);
    } while (!result);

    if (result === "b") {
        sum += 150000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք Դուք վաստակել եք 550000AMD");
    }
    yield;
    do {
        result = prompt(`հարց 9
    Ո՞ր կենդանու ուղեղն է ընկույզի չափ ?
     a) Ընձուղտ    b) խոզ    c) Կոկորդիլոս  d) Կրիա`);
    } while (!result);

    if (result === "c") {
        sum += 150000;
        alert("Դուք վաստակել եք " + sum + "AMD");
    } else {
        return alert("ցավոք դուք պարտվեցիրք Դուք վաստակել եք 550000AMD");
    }
    yield;

    alert("վերջին հարցը Եվ 1000000AMD");
    do {
        result = prompt(`Ո՞ր վիտամինն է, որ օրգանիզմը չի կարող ինքնուրույն արտադրել ?
    a) A    b) D   c) K   d) PP`);
    } while (!result);

    if (result === "a") {
        sum += 150000;
        alert("Դուք վաստակել եք " + sum + "AMD");
        alert("դուք միլիոնատեր եք, շնորհավորում ենք");
    } else {
        return alert("ցավոք դուք պարտվեցիրք Դուք վաստակել եք 550000AMD");
    }
    yield;
}

let game = millioner();

for (const value of game) {
    game.next();
}
